# Create Database

In [ ]:
import sqlite3

#create database
con = sqlite3.connect('db.sqlite3')
cur = con.cursor() # instantiate a cursor obj

#Creating Tables

In [ ]:
#Creating Tables
customers_sql = """
 CREATE TABLE customers (
     id integer PRIMARY KEY,
     first_name text NOT NULL,
     last_name text NOT NULL)"""
cur.execute(customers_sql)

products_sql = """
 CREATE TABLE products (
     id integer PRIMARY KEY,
     name text NOT NULL,
     price real NOT NULL)"""
cur.execute(products_sql)

orders_sql = """
 CREATE TABLE orders (
     id integer PRIMARY KEY,
     date text NOT NULL,
     customer_id integer,
     FOREIGN KEY (customer_id) REFERENCES customers (id))"""
cur.execute(orders_sql)

#Loading the Data

In [ ]:


product_sql = "INSERT INTO products (name, price) VALUES (?, ?)"
cur.execute(product_sql, ('Introduction to Combinatorics', 7.99))
cur.execute(product_sql, ('A Guide to Writing Short Stories', 17.99))
cur.execute(product_sql, ('Data Structures and Algorithms', 11.99))
cur.execute(product_sql, ('Advanced Set Theory', 16.99))

#Checking Data

In [ ]:

#Checking Data
cur.execute("SELECT id, name, price FROM products")
formatted_result = [f"{id:<5}{name:<35}{price:>5}" for id, name, price in cur.fetchall()]
id, product, price = "Id", "Product", "Price"
print('\n'.join([f"{id:<5}{product:<35}{price:>5}"] + formatted_result))

#Creating Methods to Insert Data to Tables

In [ ]:
def create_customer(con, first_name, last_name):
    sql = """
        INSERT INTO customers (first_name, last_name)
        VALUES (?, ?)"""
    cur = con.cursor()
    cur.execute(sql, (first_name, last_name))
    return cur.lastrowid

def create_order(con, customer_id, date):
    sql = """
        INSERT INTO orders (customer_id, date)
        VALUES (?, ?)"""
    cur = con.cursor()
    cur.execute(sql, (customer_id, date))
    return cur.lastrowid

def create_lineitem(con, order_id, product_id, qty, total):
    sql = """
        INSERT INTO lineitems
            (order_id, product_id, quantity, total)
        VALUES (?, ?, ?, ?)"""
    cur = con.cursor()
    cur.execute(sql, (order_id, product_id, qty, total))
    return cur.lastrowid

In [ ]:
try:
    codd_id = create_customer(con, 'Edgar', 'Codd')
    codd_order = create_order(con, codd_id, '1969-01-12')
    codd_li = create_lineitem(con, codd_order, 4, 1, 16.99)
    knuth_id = create_customer(con, 'Donald', 'Knuth')
    knuth_order = create_order(con, knuth_id, '1967-07-03')
    knuth_li1 = create_lineitem(con, knuth_order, 2, 1, 17.99)
    knuth_li2 = create_lineitem(con, knuth_order, 3, 1, 11.99)

    # commit the statements
    con.commit()
except:
    # rollback all database actions since last commit
    con.rollback()
    raise RuntimeError("Uh oh, an error occurred ...")

In [ ]:
cur.execute("SELECT id, first_name, last_name FROM customers")
results = cur.fetchall()
for row in results:
     print(row)

In [ ]:
cur.execute("SELECT id, first_name, last_name FROM customers WHERE id = 2")
result = cur.fetchone()
print(result)

In [ ]:

con.row_factory = sqlite3.Row
cur = con.cursor()
cur.execute("SELECT id, first_name, last_name FROM customers WHERE id = 2")
result = cur.fetchone()
id, first_name, last_name = result['id'], result['first_name'], result['last_name']
print(f"Customer: {first_name} {last_name}'s id is {id}")

# The Sql

# PostgreSQL
![alt text](https://lh4.googleusercontent.com/0mBH9Cn2ynPk-3Pd0UMn-H09XE86ztek3Oe1tQf2C3v2hndQGsJvjiYCzfnLk4L5jYWw5x98uQSQvEpnaEThVmNWC5b_AGR2Hf3Rkz4gCM7TTnNINFvL1xnredYxtGk9__QN7RWG)
![alt text](https://lh3.googleusercontent.com/WLntVdyyO-XeRSwnXH4ry16SCQX2wxNfHpXcYREauIL2XwFURWoKuxtmabW0YSxP0yxkoMIcjOiHKhACYVXsGaadjOfMxlDSA4FAse-I4n1I_VkmRoKuHiP6p7hbBAauteESbL0J)

In [4]:
import pandas as pd
import psycopg2
import matplotlib as plt

%matplotlib inline

from sqlalchemy import create_engine
# Postgres username, password, and database name
POSTGRES_ADDRESS = 'ec2-174-129-242-183.compute-1.amazonaws.com' ## INSERT YOUR DB ADDRESS IF IT'S NOT ON PANOPLY
POSTGRES_PORT = '5432'
POSTGRES_USERNAME = 'urceueneusdugn' ## CHANGE THIS TO YOUR PANOPLY/POSTGRES USERNAME
POSTGRES_PASSWORD = '0e681f9d8d43f6a31b68abd0312a1cedc17944f619873' ## CHANGE THIS TO YOUR PANOPLY/POSTGRES PASSWORD 
POSTGRES_DBNAME = 'ddec971vnf7n36' ## CHANGE THIS TO YOUR DATABASE NAME
# A long string that contains the necessary Postgres login information
postgres_str = ('postgres://urceueneusdugn:0e681f9d8d43f6a31b68abd0312a1cedc17944f61986@ec2-174-129-242-183.compute-1.amazonaws.com:5432/ddec971vnf7n36')
# Create the connection
cnx = create_engine(postgres_str)

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [5]:
pd.read_sql_query('''SELECT * FROM cars LIMIT 5;''', cnx)

   id     make  ...                 created_at                 updated_at
0   1  Try car  ... 2019-06-23 19:34:36.241129 2019-06-23 19:34:36.241129

[1 rows x 6 columns]